constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       2480;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       2485;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          220;
        startFace       2490;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1350;
        startFace       2710;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1350;
        startFace       4060;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       5410;
    }
)

// ************************************************************************* //
